const array = [1,2,3,5,8,13,21,34,55,89];


// получить массив значений * 12 (к примеру это тарифы за месяц)
// получить массив значений * 3  (к примеру это тарифы за квартал)
// mutable

for (let i = 0; i < array.length; i +=1) {
     array[i] =  array[i] * 12
}

console.log(array); 
// [ 12, 24, 36, 60, 96, 156, 252, 408, 660, 1068 ]

// А где теперь тарифы за месяц?!!
for (let i = 0; i < array.length; i +=1) {
    array[i] =  array[i] / 4
}

console.log(array); 
// [ 3, 6, 9, 15, 24, 39, 63, 102, 165, 267 ]

